## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-362405.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/4b4e8dc87ab2db4e31f88b69adc56207511ff5dd" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/4b4e8dc87ab2db4e31f88b69adc56207511ff5dd" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJTm84d3BnOWprbUV3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTFPVGt5TmpFd01UZ3pOemN6TWprM016UXlNQ0FYRFRJeU1Ea3hPREU0TURRd01Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EVTVPVEkyTVRBeE9ETTNOek15T1Rjek5ESXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRRGtUdFVXQloydXlpK2hYZzV3YnNhaHhwYXQKMXFCV2pCRmhkUXpaS3lxQ1Zld0F6OUVVUXhTZisyaHBOdVY0dm02UTlnYWFhVTRuT2FWNlZnWmZTb2Z1L202awpqMGE2Y0hwNG5sYW1sU3JkbStDdWRZYng3RnJWdGkxUkIrT0ZZaFFSYUV1QWlqbWx0R1d4c3Avd1NsQnhMK25SCmxOb3ZUSE1YdDBVcjN3M1JUMDhIWFNucUdiYWk5T1FDdktXM2VyUG5iTDZYKzRQL1VRdXZWYnl1ZCtacmE0YlEKK3NlQ3QwT01KZHlLMG9wcGZCQjRzMFNITmdOT0pLVE9DWnllOVZoZ2VFMmNnQ2Q5OGpWcUhsM3ZBb3BBU1g0WgpPeHRlZU5MOG8wby92VXpCeTgwbEhxSmxzMmhPbmhLcEZvNkVzeEVpTThtd3RHRkdmU1RmVDU1VHhVL1pBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQlpnVi9yRzEyWG8ybDdsazdIMGovQwpIbUcxUnpXT2RzSHhhQ2x2ZlpXT0poVksrSG9BUWQ1TWJjWkdFMFBOQld3bENhcW80cFI4L1F0ZzRsQlpSazBqCm45cmpIUFFZWVN2bUVUVWpIZnNlc0crVU1xRTdHRFB6OXdvalFWb1RiOEdoYVNNWlZSVFdRUHVqRC81QUlVTDEKSE53S01tN2p5ZXBEdWFnV0hKcVd3K2U5cTZXTUhMYURHUkptQlpFWTRXYnhSbzlGeDVrdFU4N0Z3d3M2UCtKRQpZSzdEWWVkZnk1ZS9Hc3hJN2dGRkd5NHJYYUVkaFRERm83Vlg2bDRsSU5JWWNsV3ZzTkc0bUVNd0RrMXM2eE45CkN1ZGFjc21ZcmtMNGhyd2VkS3R1WTYzdjZLSHNoOFYvVWNLaEFSRmZvQU4yMTZRMGdHTGZ0Z1RUYUIveHRqTDcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-18T18:04:01Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asm.data.google_container_cluster.asm will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "asm" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "terrateam-362405"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

  # module.asm.google_gke_hub_membership.membership[0] must be replaced
-/+ resource "google_gke_hub_membership" "membership" {
!       id            = "projects/terrateam-362405/locations/global/memberships/cinema-membership" -> (known after apply)
-       labels        = {} -> null
!       membership_id = "cinema-membership" -> (known after apply) # forces replacement
!       name          = "projects/terrateam-362405/locations/global/memberships/cinema-membership" -> (known after apply)
        # (1 unchanged attribute hidden)

!       endpoint {
!           gke_cluster {
!               resource_link = "//container.googleapis.com/projects/terrateam-362405/locations/us-central1/clusters/cinema" -> (known after apply) # forces replacement
            }
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
!       id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema/nodePools/core" -> (known after apply)
!       instance_group_urls         = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-a9c449a9-grp",
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-9fa27654-grp",
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroupManagers/gke-cinema-core-c29fb00a-grp",
        ] -> (known after apply)
!       managed_instance_group_urls = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroups/gke-cinema-core-a9c449a9-grp",
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroups/gke-cinema-core-9fa27654-grp",
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroups/gke-cinema-core-c29fb00a-grp",
        ] -> (known after apply)
!       max_pods_per_node           = 65 -> (known after apply)
        name                        = "core"
+       name_prefix                 = (known after apply)
!       node_count                  = 1 -> (known after apply)
+       operation                   = (known after apply)
!       version                     = "1.24.3-gke.2100" -> (known after apply)
        # (5 unchanged attributes hidden)

!       autoscaling {
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

!       node_config {
!           machine_type      = "n2-standard-2" -> "e2-highcpu-4" # forces replacement
+           min_cpu_platform  = (known after apply)
            tags              = [
                "gke-cinema",
                "gke-cinema-core",
            ]
!           taint             = [] -> (known after apply)
            # (11 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components[0] must be replaced
-/+ resource "null_resource" "additional_components" {
!       id       = "3827067522172565060" -> (known after apply)
!       triggers = {
-           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
-           "arguments"                     = "77a2b10d38c550faf4633c35dc8107fd"
-           "md5"                           = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "3110638106215764160" -> (known after apply)
!       triggers = {
-           "arguments"             = "77a2b10d38c550faf4633c35dc8107fd"
-           "create_cmd_body"       = "cinema us-central1 terrateam-362405 false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
-           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
-           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
!       id       = "7859358298443860108" -> (known after apply)
!       triggers = {
-           "destroy_cmd_body"       = "cinema us-central1 terrateam-362405 false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
-           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        } -> (known after apply) # forces replacement
    }

Plan: 6 to add, 1 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
